[job-id] 42d72ce0f8364995805eab0cbf12ef20
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Sub 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category - 1]:
             return category + 1
 
 
============

[job-id] 0c70bc25c6f5474ebeef6fd100345320
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Sub 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category - 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] 067c1f3c5e3c488e9623b9f7d171fcc3
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Mul 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category * 1]:
             return category + 1
 
 
============

[job-id] 62ab747b251e4f73980d46bf39628dba
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Mul 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category * 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] 9b155e5135b14e9a9f82dd0dfa85b8ca
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Div 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category / 1]:
             return category + 1
 
 
============

[job-id] aecd35a569304ee8807139ef4f5d5d56
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Div 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category / 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] 776ac7b217964579a5a6d8025ab7753a
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_FloorDiv 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category // 1]:
             return category + 1
 
 
============

[job-id] e5425d9138fc47a5a120eef3904b7080
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_FloorDiv 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category // 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] 5a885f0f71ed4d70a14a325048af4c9d
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Mod 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category % 1]:
             return category + 1
 
 
============

[job-id] 22e0519206ce4fd3a3347d00b516c5b6
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Mod 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category % 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] adbe52d593ca421c96d8ba85b0c964b5
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Pow 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category ** 1]:
             return category + 1
 
 
============

[job-id] 21f1466f13104764a69ac64504e13ed4
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_Pow 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category ** 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] edfc7256b13f44108a889e2d89493216
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_RShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category >> 1]:
             return category + 1
 
 
============

[job-id] 5f7bb5bd66eb49fd90fdc1c0d1118496
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_RShift 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category >> 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] be98faeb063d4968b2d1229ad3df6306
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_LShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category << 1]:
             return category + 1
 
 
============

[job-id] 184a75231bc04694a4932305c2f320b8
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_LShift 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category << 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] c2db45f70b4648d1ad5d200a03275424
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_BitOr 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category | 1]:
             return category + 1
 
 
============

[job-id] fb1d26a0859a4989988cb1aa24051e1b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_BitOr 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category | 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] ad15c41967e44b5d9760f7316e351aea
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_BitAnd 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category & 1]:
             return category + 1
 
 
============

[job-id] c212f9a5bfec4b6a8a9452d37e729657
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_BitAnd 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category & 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] 86b1976de4bf4ad29b35e70019867a04
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_BitXor 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category ^ 1]:
             return category + 1
 
 
============

[job-id] 9a2c715f0ce44f56b87aeb8ae6fded4e
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Add_BitXor 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category ^ 1
 
 
 def get_pickle2json_dataframe(
============

[job-id] 0c03a98197034562b517bfabf127ed0e
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_Add 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) + 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] 9b3d6f260bba4002aaecdbb4cbbf9d8e
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_Mul 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) * 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] debaf34c846442289e88214fd9c32228
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_Div 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) / 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] 68d1e16ac9c7450f80108b31c9a7ad04
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_FloorDiv 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) // 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] 3e9191f1d4f341ed9007de87cd4f6e72
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_Mod 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) % 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] dd56237e8ec2430cbfa537422f25ac2b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_Pow 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) ** 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] 27b7c25f160945f5907ac256b7d8f3c4
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_RShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) >> 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] efaf8b1605ae4a5fb7464b33855b0cf3
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_LShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) << 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] deba1e73baf74fa8bdfdec923fce98b9
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_BitOr 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) | 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] 9646dbf864964845b1f7dbeec80f5204
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_BitAnd 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) & 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] 7568d3cd808843f085ae352af039a91f
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Sub_BitXor 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) ^ 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] ad48cfbb4f624b8099ebc3d59559c15e
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Add 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER + "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] aaee2177c39748ee9bdfd1ee542b7fbe
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Add 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" + "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 4bc8950803e745b2975a4b2377cd0192
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Add 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder + 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] b6dc287cf0d445ada542e02ae88f1e11
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Add 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder + f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] 3aaf481d92ac49f78a6e9068aae0392a
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Add 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder + f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] a829bffa61594cc785ca6f4ce6f8f56d
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Sub 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER - "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 33a2f11aabf44a82bb10ea106ea856ba
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Sub 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" - "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 38a1a88f851c42e8b0cb37e89ecd14ae
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Sub 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder - 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] 5fe365272a6b41bdbc0089a13b0f9956
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Sub 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder - f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============
