[job-id] e3489e8fbc9f4561a05fb273068d9b96
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Sub 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder - f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] f2f230fadc7a4479bfc2920a73b00611
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mul 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER * "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 590cef885e0646f6ac28d36d48e40a62
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mul 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" * "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 40a2045540bf4d2491021922bee63d84
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mul 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder * 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] 37aef5474ca74d3b989094a35abee871
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mul 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder * f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] 3ed969ae897a43fc97cd4111c2770fe9
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mul 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder * f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] 152588adb8ea4f058bab82b6eedfec5b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_FloorDiv 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER // "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 45d67c1db8b649e38bbafcc169a3ba6b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_FloorDiv 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" // "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] b0082880649e45b085ab9e5a7b84eeae
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_FloorDiv 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder // 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] a19fc62b899449abaa1d92561e21c31e
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_FloorDiv 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder // f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] aa138ca5b7f14464b616f436d13e0fca
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_FloorDiv 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder // f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] 4037cacacd194beb97e8a09ccbd49e88
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mod 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER % "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 60696ce3075f42259c189341958a9284
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mod 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" % "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 9e28aa15c2dc46cbab05b53838432261
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mod 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder % 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] 828d7ee1da184a8eb5fbde9d83de6560
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mod 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder % f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] 4b9247acc105467f8699b9f1c04501a4
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Mod 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder % f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] 00b685040d434282b74ba77069699986
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Pow 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER ** "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 22985b9d81594f3f85ade440143b6bcc
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Pow 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" ** "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 48efcb020c0f4c86a242854429e60d94
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Pow 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder ** 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] 7c34437632804b60bac4f722839f76e9
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Pow 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder ** f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] 8e5c19663ac341458cb906dd8bf0fd8b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_Pow 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder ** f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] 499bc42b2fb34d0f86dd769239f2ef69
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_RShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER >> "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 38637845fe6d4845b19ead86d43f8e5a
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_RShift 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" >> "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] dfe005ff4ab443d0932b6d708a25729c
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_RShift 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder >> 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] f1dd8f82ae2b4909bf5eeb146e3e8fb4
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_RShift 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder >> f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] abe38f1eea3d482bae481c5c866a8e3f
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_RShift 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder >> f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] 5b734d0c32a24cb0af94773baf47845a
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_LShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER << "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 5bc3db142150436c972bb52a59e29976
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_LShift 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" << "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 1557ab3b29cf4fa2a64e3e817cf48ac0
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_LShift 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder << 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] a70e3d4f246a465887a3eb310a160c5d
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_LShift 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder << f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] 6e6c7695c8604a0ca264da0a2caea685
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_LShift 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder << f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] 8fb0bf4c125c47fc8d7ba1115e8447fd
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitOr 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER | "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 1da28de1e690455499f99a7ac3ccbbee
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitOr 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" | "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] c519f851143547e981422490b9ce16f8
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitOr 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder | 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] ab5ca751ab8442fcb1db50c7650f33c0
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitOr 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder | f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] 17a59406e83d42a8b63a9f2df903eff0
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitOr 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder | f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] 4c70103f1d7b40fcb5b1a20d3c23dfb4
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitAnd 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER & "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] e979603744ae4b7896ec06b8c22e536b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitAnd 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" & "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 0d310b56d64545d58e348b94e98ed0a6
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitAnd 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder & 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] eaeb7f5de1674e6ca58f08e75410e080
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitAnd 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder & f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============

[job-id] e2579b965aa2478d96db0ae152ba2d7b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitAnd 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder & f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] b268e601d3994c83a7d18ffea9f9369a
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitXor 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER ^ "aip_trainer" / "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] abd95f5cb22d46f38ff630bcfb2d370f
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitXor 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -37,7 +37,7 @@
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
-sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
+sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" ^ "lambdas")
 lambda_database = {}
 lambda_ipa_converter = {}
 
============

[job-id] 934c5fa4b62a4989986a6da13bc51676
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitXor 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -41,7 +41,7 @@
 lambda_database = {}
 lambda_ipa_converter = {}
 
-with open(sample_folder / 'data_de_en_with_categories.json', 'r') as src:
+with open(sample_folder ^ 'data_de_en_with_categories.json', 'r') as src:
     df = pd.read_json(src)
 
 lambda_database['de'] = TextDataset(df, 'de')
============

[job-id] 51a85394b9e1439fa3c6339e5a06633b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitXor 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -97,7 +97,7 @@
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
+    with open(custom_folder ^ f'{custom_pickle_filename_no_ext}.pickle', 'rb') as handle:
         df2 = pickle.load(handle)
         pass
         df2["de_category"] = df2["de_sentence"].apply(getSentenceCategory)
============
