[job-id] ba8d61ff35e3465f970a25eeb10f1820
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_Div_BitXor 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -105,7 +105,7 @@
         df2["en_category"] = df2["en_sentence"].apply(getSentenceCategory)
         print("en_category added")
     df_json = df2.to_json()
-    with open(custom_folder / f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
+    with open(custom_folder ^ f'{custom_pickle_filename_no_ext}.json', 'w') as dst:
         dst.write(df_json)
         print("data_de_en_with_categories.json written")
 
============

[job-id] 0d6c05e129f146439c33384613bc1c04
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_Add 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path + str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] e85055f86a464f56af2504f94980e9ae
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_Sub 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path - str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] e8bf20672c3a490684fa027539ec9406
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_Mul 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path * str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] 4cd4492feee44b788737f0e210d927e8
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_Div 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path / str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] 91c211d3d8e44567b1b29565ecb6eadd
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_FloorDiv 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path // str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] f891f5d3e1954f4883668d002ff60982
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_Mod 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path % str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] e5445cbe1f354d42a7dab9a14420d05a
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_Pow 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path ** str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] 7f8b748b570e4b69a76598714342ca65
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_RShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path >> str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] 2bdcd55ec8284ec3ae897c7685b21cca
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_LShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path << str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] 6191a766f80c442dae738bb2aed3d563
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_BitAnd 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path & str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] 17b123568f2b49b1a14de8341a612b17
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceBinaryOperator_BitOr_BitXor 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -93,7 +93,7 @@
 
 
 def get_pickle2json_dataframe(
-        custom_pickle_filename_no_ext: Path | str = 'data_de_en_2',
+        custom_pickle_filename_no_ext: Path ^ str = 'data_de_en_2',
         custom_folder: Path = sample_folder
     ):
     custom_folder = Path(custom_folder)
============

[job-id] 753f462e1a1d44eb9b151393c9b41371
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Eq_NotEq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -24,7 +24,7 @@
         return self.number_of_samples
 
     def get_category_from_df_by_language(self, language: str, category_value:int):
-        selector = self.table_dataframe[f"{language}_category"] == category_value
+        selector = self.table_dataframe[f"{language}_category"] != category_value
         df_by_category = self.table_dataframe[selector]
         return df_by_category
 
============

[job-id] 3172a5713d114ec6aa3ebfbba6551fa4
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Eq_Lt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -24,7 +24,7 @@
         return self.number_of_samples
 
     def get_category_from_df_by_language(self, language: str, category_value:int):
-        selector = self.table_dataframe[f"{language}_category"] == category_value
+        selector = self.table_dataframe[f"{language}_category"] < category_value
         df_by_category = self.table_dataframe[selector]
         return df_by_category
 
============

[job-id] 01e8086266b74c6da0a3322753bce2d6
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Eq_LtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -24,7 +24,7 @@
         return self.number_of_samples
 
     def get_category_from_df_by_language(self, language: str, category_value:int):
-        selector = self.table_dataframe[f"{language}_category"] == category_value
+        selector = self.table_dataframe[f"{language}_category"] <= category_value
         df_by_category = self.table_dataframe[selector]
         return df_by_category
 
============

[job-id] da2fe52cb64b42a9aea91833bbb7903f
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Eq_Gt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -24,7 +24,7 @@
         return self.number_of_samples
 
     def get_category_from_df_by_language(self, language: str, category_value:int):
-        selector = self.table_dataframe[f"{language}_category"] == category_value
+        selector = self.table_dataframe[f"{language}_category"] > category_value
         df_by_category = self.table_dataframe[selector]
         return df_by_category
 
============

[job-id] f7606ea03ff549dea22526d6f73f1cb4
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Eq_GtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -24,7 +24,7 @@
         return self.number_of_samples
 
     def get_category_from_df_by_language(self, language: str, category_value:int):
-        selector = self.table_dataframe[f"{language}_category"] == category_value
+        selector = self.table_dataframe[f"{language}_category"] >= category_value
         df_by_category = self.table_dataframe[selector]
         return df_by_category
 
============

[job-id] 4b1944d75ac24f7f821ce922f87262f7
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Eq_Is 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -24,7 +24,7 @@
         return self.number_of_samples
 
     def get_category_from_df_by_language(self, language: str, category_value:int):
-        selector = self.table_dataframe[f"{language}_category"] == category_value
+        selector = self.table_dataframe[f"{language}_category"] is category_value
         df_by_category = self.table_dataframe[selector]
         return df_by_category
 
============

[job-id] 13f2154a95e24bc390cfb0b67c7e97f2
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Eq_IsNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -24,7 +24,7 @@
         return self.number_of_samples
 
     def get_category_from_df_by_language(self, language: str, category_value:int):
-        selector = self.table_dataframe[f"{language}_category"] == category_value
+        selector = self.table_dataframe[f"{language}_category"] is not category_value
         df_by_category = self.table_dataframe[selector]
         return df_by_category
 
============

[job-id] 17840597b61346e0a7a7331519787579
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_Eq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -16,7 +16,7 @@
         self.language = language
 
     def __getitem__(self, idx):
-        language_sentence = f"{self.language}_sentence" if self.language != '-' else 'sentence'
+        language_sentence = f"{self.language}_sentence" if self.language == '-' else 'sentence'
         language_series = self.table_dataframe[language_sentence]
         return [language_series.iloc[idx]]
 
============

[job-id] 0edb7e44f3dd441cb3ca69326ad415d9
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_Eq 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -31,7 +31,7 @@
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
         choice = self.table_dataframe.sample(n=1)
-        if category_value !=0:
+        if category_value ==0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
         return [choice[f"{language}_sentence"].iloc[0]]
============

[job-id] ddbcf9db93ab4ac99f7269230054ff54
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_Lt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -16,7 +16,7 @@
         self.language = language
 
     def __getitem__(self, idx):
-        language_sentence = f"{self.language}_sentence" if self.language != '-' else 'sentence'
+        language_sentence = f"{self.language}_sentence" if self.language < '-' else 'sentence'
         language_series = self.table_dataframe[language_sentence]
         return [language_series.iloc[idx]]
 
============

[job-id] f3721f190f8b4588be76d3e70669bd32
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_Lt 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -31,7 +31,7 @@
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
         choice = self.table_dataframe.sample(n=1)
-        if category_value !=0:
+        if category_value <0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
         return [choice[f"{language}_sentence"].iloc[0]]
============

[job-id] b2b299fe70144237a28e1b40b244e8d5
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_LtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -16,7 +16,7 @@
         self.language = language
 
     def __getitem__(self, idx):
-        language_sentence = f"{self.language}_sentence" if self.language != '-' else 'sentence'
+        language_sentence = f"{self.language}_sentence" if self.language <= '-' else 'sentence'
         language_series = self.table_dataframe[language_sentence]
         return [language_series.iloc[idx]]
 
============

[job-id] 7bd195570790456e92d24ea3bc112b7e
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_LtE 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -31,7 +31,7 @@
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
         choice = self.table_dataframe.sample(n=1)
-        if category_value !=0:
+        if category_value <=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
         return [choice[f"{language}_sentence"].iloc[0]]
============

[job-id] c8f8f3e58d944c9b8b1de7928a274d0b
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_Gt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -16,7 +16,7 @@
         self.language = language
 
     def __getitem__(self, idx):
-        language_sentence = f"{self.language}_sentence" if self.language != '-' else 'sentence'
+        language_sentence = f"{self.language}_sentence" if self.language > '-' else 'sentence'
         language_series = self.table_dataframe[language_sentence]
         return [language_series.iloc[idx]]
 
============

[job-id] 0a3c1c8a9fa04850a187c0cd718488c8
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_Gt 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -31,7 +31,7 @@
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
         choice = self.table_dataframe.sample(n=1)
-        if category_value !=0:
+        if category_value >0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
         return [choice[f"{language}_sentence"].iloc[0]]
============

[job-id] d03e0002e8394137add68c1c68c8e912
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_GtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -16,7 +16,7 @@
         self.language = language
 
     def __getitem__(self, idx):
-        language_sentence = f"{self.language}_sentence" if self.language != '-' else 'sentence'
+        language_sentence = f"{self.language}_sentence" if self.language >= '-' else 'sentence'
         language_series = self.table_dataframe[language_sentence]
         return [language_series.iloc[idx]]
 
============

[job-id] f451a32294024e519b6bf0e037b5e68d
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_GtE 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -31,7 +31,7 @@
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
         choice = self.table_dataframe.sample(n=1)
-        if category_value !=0:
+        if category_value >=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
         return [choice[f"{language}_sentence"].iloc[0]]
============

[job-id] 811f3d214c524c5fbec812dfdeee55ff
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_Is 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -16,7 +16,7 @@
         self.language = language
 
     def __getitem__(self, idx):
-        language_sentence = f"{self.language}_sentence" if self.language != '-' else 'sentence'
+        language_sentence = f"{self.language}_sentence" if self.language is '-' else 'sentence'
         language_series = self.table_dataframe[language_sentence]
         return [language_series.iloc[idx]]
 
============

[job-id] 28701b11bcdb4bd8bafc826ee2845239
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_NotEq_IsNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -16,7 +16,7 @@
         self.language = language
 
     def __getitem__(self, idx):
-        language_sentence = f"{self.language}_sentence" if self.language != '-' else 'sentence'
+        language_sentence = f"{self.language}_sentence" if self.language is not '-' else 'sentence'
         language_series = self.table_dataframe[language_sentence]
         return [language_series.iloc[idx]]
 
============

[job-id] 65c9d7a87b044dd8be5e36a4189e49be
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Lt_Eq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] == number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] 24312eafeaf0474b92216eee7ae463ce
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Lt_NotEq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] != number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] a61da68b90f34afeb56900b464faa43f
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Lt_LtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] <= number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] af78f916bc3d43f8b74bef3d851ff44c
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Lt_Gt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] > number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] eda4ea12ba7b41558a466e7d3bdc1173
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Lt_GtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] >= number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] e3257b03506d4e90bf2757d27773c545
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Lt_Is 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] is number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] e90c12d9c18e4f1da57dd9eedffc735c
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_Lt_IsNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] is not number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] d4dc5c0866cb47feba95de5acc6381e6
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_LtE_Eq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words == categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] 672b1bcd9d5b48fe86ba6f8376c01477
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_LtE_NotEq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words != categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] 3032435c6873480b8105ec01fe015239
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_LtE_Lt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words < categories_word_limits[category + 1]:
             return category + 1
 
 
============
