[job-id] 0fb03755d56b49fead3b04ef72ade6f0
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_LtE_Gt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words > categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] 6938aee4612944eba029ff82e8a0fc65
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_LtE_GtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words >= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] b2cf5ae34d8846098574c1f0f0f68ecc
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_LtE_Is 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words is categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] 0daa16aaaa804365a54ca6c2ab8c24b3
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceComparisonOperator_LtE_IsNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words is not categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] e79b262c01ae4a57abb2b2fc209a64d7
aip_trainer/lambdas/lambdaGetSample.py core/AddNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -16,7 +16,7 @@
         self.language = language
 
     def __getitem__(self, idx):
-        language_sentence = f"{self.language}_sentence" if self.language != '-' else 'sentence'
+        language_sentence = f"{self.language}_sentence" if not self.language != '-' else 'sentence'
         language_series = self.table_dataframe[language_sentence]
         return [language_series.iloc[idx]]
 
============

[job-id] 3602ad1624764e06b1446f423311f5da
aip_trainer/lambdas/lambdaGetSample.py core/AddNot 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -31,7 +31,7 @@
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
         choice = self.table_dataframe.sample(n=1)
-        if category_value !=0:
+        if not category_value !=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
         return [choice[f"{language}_sentence"].iloc[0]]
============

[job-id] cd66bdbe8d984a039cf1bb23641bcf3f
aip_trainer/lambdas/lambdaGetSample.py core/AddNot 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -64,7 +64,7 @@
         current_transcript = str(body["transcript"])
     except KeyError:
         current_transcript = get_random_selection(language, category, is_gradio_output=False)
-    current_transcript = current_transcript if isinstance(current_transcript, str) else current_transcript[0]
+    current_transcript = current_transcript if not isinstance(current_transcript, str) else current_transcript[0]
     current_ipa = lambda_ipa_converter[language].convertToPhonem(current_transcript)
 
     app_logger.info(f"real_transcript='{current_transcript}', ipa_transcript='{current_ipa}'.")
============

[job-id] d0e4a470f069484bb31bad71de68ef07
aip_trainer/lambdas/lambdaGetSample.py core/AddNot 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -81,7 +81,7 @@
     lambda_df_lang = lambda_database[language]
     current_transcript = lambda_df_lang.get_random_sample_from_df(language, category)
     app_logger.info(f"category={category}, language={language}, current_transcript={current_transcript}.")
-    return current_transcript[0] if is_gradio_output else current_transcript
+    return current_transcript[0] if not is_gradio_output else current_transcript
 
 
 def getSentenceCategory(sentence) -> int:
============

[job-id] 818212f2ec34492f94e8dbcff2481b2e
aip_trainer/lambdas/lambdaGetSample.py core/AddNot 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if not categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
 
============

[job-id] 9693b76a4ee943149d059b7601623e72
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceTrueWithFalse 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -77,7 +77,7 @@
     return json.dumps(result)
 
 
-def get_random_selection(language: str, category: int, is_gradio_output=True):
+def get_random_selection(language: str, category: int, is_gradio_output=False):
     lambda_df_lang = lambda_database[language]
     current_transcript = lambda_df_lang.get_random_sample_from_df(language, category)
     app_logger.info(f"category={category}, language={language}, current_transcript={current_transcript}.")
============

[job-id] 62c07e8977a34948a2f8aa14b253bc8a
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceFalseWithTrue 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -46,7 +46,7 @@
 
 lambda_database['de'] = TextDataset(df, 'de')
 lambda_database['en'] = TextDataset(df, 'en')
-lambda_translate_new_sample = False
+lambda_translate_new_sample = True
 lambda_ipa_converter['de'] = RuleBasedModels.EpitranPhonemConverter(
     epitran.Epitran('deu-Latn'))
 lambda_ipa_converter['en'] = RuleBasedModels.EngPhonemConverter()
============

[job-id] 2ec185737bd64ff6b7f6ec59c7048fd6
aip_trainer/lambdas/lambdaGetSample.py core/ReplaceFalseWithTrue 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -63,7 +63,7 @@
     try:
         current_transcript = str(body["transcript"])
     except KeyError:
-        current_transcript = get_random_selection(language, category, is_gradio_output=False)
+        current_transcript = get_random_selection(language, category, is_gradio_output=True)
     current_transcript = current_transcript if isinstance(current_transcript, str) else current_transcript[0]
     current_ipa = lambda_ipa_converter[language].convertToPhonem(current_transcript)
 
============

[job-id] 73f99bd64832450abbd34a142c8022a2
aip_trainer/lambdas/lambdaGetSample.py core/ExceptionReplacer 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -57,7 +57,7 @@
 
     try:
         category = int(body['category'])
-    except KeyError:
+    except CosmicRayTestingException:
         category = 0
     language = body['language']
     try:
============

[job-id] 19f2e67432f649cc9fc68c7c21f0ac17
aip_trainer/lambdas/lambdaGetSample.py core/ExceptionReplacer 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -62,7 +62,7 @@
     language = body['language']
     try:
         current_transcript = str(body["transcript"])
-    except KeyError:
+    except CosmicRayTestingException:
         current_transcript = get_random_selection(language, category, is_gradio_output=False)
     current_transcript = current_transcript if isinstance(current_transcript, str) else current_transcript[0]
     current_ipa = lambda_ipa_converter[language].convertToPhonem(current_transcript)
============

[job-id] 362d4380ee244a3683f0303108854eeb
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -30,7 +30,7 @@
 
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
-        choice = self.table_dataframe.sample(n=1)
+        choice = self.table_dataframe.sample(n= 2)
         if category_value !=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
============

[job-id] 5ea8998353df4be8a4234a40717f6771
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -30,7 +30,7 @@
 
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
-        choice = self.table_dataframe.sample(n=1)
+        choice = self.table_dataframe.sample(n= 0)
         if category_value !=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
============

[job-id] 49c64bc946784ccbb93bcb5429c9539b
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -31,7 +31,7 @@
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
         choice = self.table_dataframe.sample(n=1)
-        if category_value !=0:
+        if category_value != 1:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
         return [choice[f"{language}_sentence"].iloc[0]]
============

[job-id] 406f7b63c2a6445eb4a191241d7ef329
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -31,7 +31,7 @@
     def get_random_sample_from_df(self, language: str, category_value:int):
         app_logger.info(f"language={language}, category_value={category_value}.")
         choice = self.table_dataframe.sample(n=1)
-        if category_value !=0:
+        if category_value != -1:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
         return [choice[f"{language}_sentence"].iloc[0]]
============

[job-id] 276c16029b324e398c521a74a6fb273e
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -33,7 +33,7 @@
         choice = self.table_dataframe.sample(n=1)
         if category_value !=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
-            choice = df_language_filtered_by_category_and_language.sample(n=1)
+            choice = df_language_filtered_by_category_and_language.sample(n= 2)
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
============

[job-id] 112c59c2992041688b0d8ed08ef261c3
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -33,7 +33,7 @@
         choice = self.table_dataframe.sample(n=1)
         if category_value !=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
-            choice = df_language_filtered_by_category_and_language.sample(n=1)
+            choice = df_language_filtered_by_category_and_language.sample(n= 0)
         return [choice[f"{language}_sentence"].iloc[0]]
 
 
============

[job-id] 68e40ba0dd8241c491a8b58953fd3fc9
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -34,7 +34,7 @@
         if category_value !=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
-        return [choice[f"{language}_sentence"].iloc[0]]
+        return [choice[f"{language}_sentence"].iloc[ 1]]
 
 
 sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
============

[job-id] 08d6af953b9f49f18ec93192d8bfece3
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -34,7 +34,7 @@
         if category_value !=0:
             df_language_filtered_by_category_and_language = self.get_category_from_df_by_language(language, category_value)
             choice = df_language_filtered_by_category_and_language.sample(n=1)
-        return [choice[f"{language}_sentence"].iloc[0]]
+        return [choice[f"{language}_sentence"].iloc[ -1]]
 
 
 sample_folder = Path(PROJECT_ROOT_FOLDER / "aip_trainer" / "lambdas")
============

[job-id] 84a17611bc424ac4abd9c190187ba779
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -58,7 +58,7 @@
     try:
         category = int(body['category'])
     except KeyError:
-        category = 0
+        category = 1
     language = body['language']
     try:
         current_transcript = str(body["transcript"])
============

[job-id] dfddb52528ed42a3988b33783e70139f
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 9
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -58,7 +58,7 @@
     try:
         category = int(body['category'])
     except KeyError:
-        category = 0
+        category = -1
     language = body['language']
     try:
         current_transcript = str(body["transcript"])
============

[job-id] c783f88a777647a981e4cd5a54fc2579
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 10
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -64,7 +64,7 @@
         current_transcript = str(body["transcript"])
     except KeyError:
         current_transcript = get_random_selection(language, category, is_gradio_output=False)
-    current_transcript = current_transcript if isinstance(current_transcript, str) else current_transcript[0]
+    current_transcript = current_transcript if isinstance(current_transcript, str) else current_transcript[ 1]
     current_ipa = lambda_ipa_converter[language].convertToPhonem(current_transcript)
 
     app_logger.info(f"real_transcript='{current_transcript}', ipa_transcript='{current_ipa}'.")
============

[job-id] a3a844680d254fd4a0f5d75e8abc2870
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 11
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -64,7 +64,7 @@
         current_transcript = str(body["transcript"])
     except KeyError:
         current_transcript = get_random_selection(language, category, is_gradio_output=False)
-    current_transcript = current_transcript if isinstance(current_transcript, str) else current_transcript[0]
+    current_transcript = current_transcript if isinstance(current_transcript, str) else current_transcript[ -1]
     current_ipa = lambda_ipa_converter[language].convertToPhonem(current_transcript)
 
     app_logger.info(f"real_transcript='{current_transcript}', ipa_transcript='{current_ipa}'.")
============

[job-id] 39d2d950df84448a803210234f9876ef
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 12
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -81,7 +81,7 @@
     lambda_df_lang = lambda_database[language]
     current_transcript = lambda_df_lang.get_random_sample_from_df(language, category)
     app_logger.info(f"category={category}, language={language}, current_transcript={current_transcript}.")
-    return current_transcript[0] if is_gradio_output else current_transcript
+    return current_transcript[ 1] if is_gradio_output else current_transcript
 
 
 def getSentenceCategory(sentence) -> int:
============

[job-id] 0e779c6a7141405eb8baf0954c797f83
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 13
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -81,7 +81,7 @@
     lambda_df_lang = lambda_database[language]
     current_transcript = lambda_df_lang.get_random_sample_from_df(language, category)
     app_logger.info(f"category={category}, language={language}, current_transcript={current_transcript}.")
-    return current_transcript[0] if is_gradio_output else current_transcript
+    return current_transcript[ -1] if is_gradio_output else current_transcript
 
 
 def getSentenceCategory(sentence) -> int:
============

[job-id] a22aa0fa54e545898774f596854b3eeb
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 14
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -86,7 +86,7 @@
 
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
-    categories_word_limits = [0, 8, 20, 100000]
+    categories_word_limits = [ 1, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
============

[job-id] 8adfb17c55974eef807687b830b59675
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 15
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -86,7 +86,7 @@
 
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
-    categories_word_limits = [0, 8, 20, 100000]
+    categories_word_limits = [ -1, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
============

[job-id] 0255dc93c95b4564bcf273c51ba5e632
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 16
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -86,7 +86,7 @@
 
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
-    categories_word_limits = [0, 8, 20, 100000]
+    categories_word_limits = [0, 9, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
============

[job-id] 7a6a816321104ac4a737e86eafab8a19
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 17
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -86,7 +86,7 @@
 
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
-    categories_word_limits = [0, 8, 20, 100000]
+    categories_word_limits = [0, 7, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
============

[job-id] f52f63cceb984975b348dc1830d6178e
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 18
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -86,7 +86,7 @@
 
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
-    categories_word_limits = [0, 8, 20, 100000]
+    categories_word_limits = [0, 8, 21, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
============

[job-id] 2e689b3a02c64b779e8bc3643d8752f8
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 19
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -86,7 +86,7 @@
 
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
-    categories_word_limits = [0, 8, 20, 100000]
+    categories_word_limits = [0, 8, 19, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
============

[job-id] 4e4196490c4c459ba6df204d5d86170c
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 20
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -86,7 +86,7 @@
 
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
-    categories_word_limits = [0, 8, 20, 100000]
+    categories_word_limits = [0, 8, 20, 100001]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
============

[job-id] fc64793709ef4c3eb57c7c37caa8a0e3
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 21
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -86,7 +86,7 @@
 
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
-    categories_word_limits = [0, 8, 20, 100000]
+    categories_word_limits = [0, 8, 20, 99999]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
============

[job-id] 85e38a5cda434a7b880819a5de81fb4e
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 22
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) - 2):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] 7db4529ad2714a5eab16fc0cb04370da
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 23
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in range(len(categories_word_limits) - 0):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============

[job-id] 4db0287cc4b346be9059230740b05f72
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 24
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 2]:
             return category + 1
 
 
============
