[job-id] 01f176487ddd48be874037915fd17502
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 25
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -88,7 +88,7 @@
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
-        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
+        if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 0]:
             return category + 1
 
 
============

[job-id] 5b16ad9a7b354b46ae6a1d03b63caf0f
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 26
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category + 2
 
 
 def get_pickle2json_dataframe(
============

[job-id] db2ea6637c3b4c20909af8b4c3867c87
aip_trainer/lambdas/lambdaGetSample.py core/NumberReplacer 27
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -89,7 +89,7 @@
     categories_word_limits = [0, 8, 20, 100000]
     for category in range(len(categories_word_limits) - 1):
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
-            return category + 1
+            return category + 0
 
 
 def get_pickle2json_dataframe(
============

[job-id] 37c42149eea1466ba489d91e521ddb25
aip_trainer/lambdas/lambdaGetSample.py core/ZeroIterationForLoop 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/lambdas/lambdaGetSample.py
+++ baip_trainer/lambdas/lambdaGetSample.py
@@ -87,7 +87,7 @@
 def getSentenceCategory(sentence) -> int:
     number_of_words = len(sentence.split())
     categories_word_limits = [0, 8, 20, 100000]
-    for category in range(len(categories_word_limits) - 1):
+    for category in []:
         if categories_word_limits[category] < number_of_words <= categories_word_limits[category + 1]:
             return category + 1
 
============
total jobs: 171
complete: 171 (100.00%)
surviving mutants: 32 (18.71%)
