[job-id] ae854cff18a342ecac2ef2f759289634
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_Sub 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']-fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 3e27a7ddcae2449d948fdc5513c1f03e
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_Mul 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']*fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 39cf12d01e404d39929763b8e734bd09
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_Div 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']/fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] cb3d51346df24ba0b1115a6e4e34ed56
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_FloorDiv 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']//fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] f0ffd915a3894f709f5718dd4d1e8cb1
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_Mod 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']%fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] b487b0322a6d45568d628e1f71201535
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_Pow 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']**fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] ba524962cf5b469a8d5c2625f17f8cbd
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_RShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']>>fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] b684ccd554e747ab8064f14a7415866e
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_LShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']<<fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 3548e039cf374cb282997c17f5837469
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_BitOr 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']|fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 592fa740d42c450b833af8513d0cb721
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_BitAnd 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']&fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] bc4f2029273c482fabd49281caaa712b
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Add_BitXor 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples-1, word['end_ts']^fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 609554e3c26242779e0d223d5e3b64df
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']+fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] 078739cb19b64c93b934b057d8a75636
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples+1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 4b94d9a1580a4788964aa8bb7b1e5f84
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() + start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] 92560397fa324759b7192f090b7f7338
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() + start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] 2c3c8b95f59c41b98af4ec9a3edf81a5
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)+1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] fcfc0e8fd3424a08ae71ca15814fad29
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word+number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 5b24ee8c803443dcb37a796c68f836f9
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes+total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 2236adf28c0841f4b71f87c675eb8118
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds+accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] d848ce3ec09242c0841caee7aa259370
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Add 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio+torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 9c3c6cab2f214d6daea90651560f2462
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']*fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] c5ef9e975af84a9fbbb2ca57e48c7057
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples*1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 01f3f7a1c6cf4bda90b529ad5ac4dd56
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() * start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] ca561826d98e4a0b8399121b43e4651e
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() * start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] 6a08e9adbe294d008602c89ff43cee79
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)*1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] b27657d3fcc34625ba220d18fe2fd41c
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word*number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] b44c93ecfbab4835a185e40a89fbfa8a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes*total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] ec30367fd7774791bc9742dff722a0a8
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds*accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] 3ba572cccd2e4cc1813b96eefc250903
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mul 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio*torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 41533902f9af4507919bfb885f6f5e3b
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']/fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] 6b029aab934b45aea1cee190180e3484
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples/1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 1584386cff404d94a425435bcc28a8d5
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() / start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] 947d06ca66d94558aeeb7c02eb437e5a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() / start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] b1bd3a34b541434c967a57c80601032c
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)/1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 26aeb4f35e06447cb0ddd3be38986699
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word/number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 5a0302ef2e3f4455b53f020da1c8f102
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes/total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] c0de19210707460da80d8350d1eb0fad
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds/accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] 1325eb96d40b4cd38f24b48a436c048c
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Div 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio/torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============
