[job-id] 9334e714b3294d56949d55e138b21a19
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']//fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] c03619105c25437fb672d18f995ea29a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples//1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 3af1ab91fcca4d609ba0499541005a07
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() // start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] b5676fa6357d47fe8e04872270051bb8
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() // start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] ef16806abc714390ad6ecbfb0aa0d199
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)//1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 44fd52a764614a5fa5559dcd5ee66173
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word//number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] d30e73191e074d9f9e651408b55aa9bb
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes//total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] df3630a9dff643a7b6085810986c3add
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds//accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] 233f1b076bcc4e3ebe42d3a885beac8c
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_FloorDiv 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio//torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] bd0db9ce8505436582135c83acdcec88
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']%fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] 4ad5670cf7274d589f8825cb43a67a32
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples%1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 99c6bbf3e5094548af0c8fcc61e47908
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() % start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] e52e76c570a04b1e9c2f908cd372e0d6
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() % start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] fb9a1abb5f3a4a158b924ef67bfa26e4
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)%1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 6486426a78fd4d5ab6a2042b3280abb3
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word%number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] fd05fe1a367e43b3aa9f587a01c293f2
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes%total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 0710e610f2e74880b66dd1ab99e965b7
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds%accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] 57added1d40a49d290941e3b2b366679
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Mod 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio%torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 8253f29d1acf4860a27703e2c88df31a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']**fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] a4a075b949ee494faa32751bac405fe7
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples**1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] c90eb75a016c4c63b4f06f02c2f891be
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() ** start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] 80d7c191bf9e4c648fa0b86103512c24
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() ** start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] 4e23dff4c4a742b5ba264d99df3e7022
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)**1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 8c0c042e5d234629a1f5fb553117e175
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word**number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] c98b25fce57a4bd9899cbf1e1f191e1b
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes**total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] f37467000e4940099b5011ad1667eceb
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds**accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] 60e8ab6f950044738476ad82b3071af2
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_Pow 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio**torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 3b47c3ad402e40f6adecf8b25f729b30
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']>>fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] f74a942c1de34a7e85df5e2e13ab464e
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples>>1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] cd7b63c61e9245e594ce2bf0742e2f23
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() >> start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] c6984195eb734b30880eeb57a3c6bfac
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() >> start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] e5306181c92d449991343bfaeff3e6f0
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)>>1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 8c8ac6e27e434200a34806abb2f8ae2f
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word>>number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] c0435a30c54d4485bc18416e066c16f7
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes>>total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] fd371f30798948fd97903a0be7fe5ae6
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds>>accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] cf077a6cc6c848b1984c3bd869ed6ac5
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_RShift 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio>>torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 3c5e7d0970d84bc19368665218dfa1cd
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']<<fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] 0a5eb7efbf8641fc9c1d3cd724b3e751
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples<<1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] c889e83bbb114b50bbff1f038ea0fa91
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() << start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============
