[job-id] 69512310a7484f37a21cd9883309850e
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() << start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] 8a2b6bab6e404db28ca4eb7be76a28cb
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)<<1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] d48e3909b5c741d19bc3ae3346b1d87b
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word<<number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 3e17840db36040a28aae9b539e026646
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes<<total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 9f7e794d5e98480c933d92138b76b47d
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds<<accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] 17b89af115744f0d8d80851379b0b4a7
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_LShift 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio<<torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 0404e59029e14e45a66fb39cd06cc1aa
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']|fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] 710f1f0d3a4c4e7eb03590f8b2776dd7
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples|1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] fa32c7c210ac4f05ae824cf158e48ddd
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() | start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] a7da06311469494788435aa16de3397b
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() | start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] 67589c2d9ace4199b8ecdd7adda9ab2b
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)|1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 9362552e176c4935b7af91c92a81fced
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word|number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] e073fba869234f439f6022449e6b51e3
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes|total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 39215bf271f642e290a25bbb83c7fc59
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds|accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] ce48bd562803412c98abb58bbecaadc1
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitOr 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio|torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] e4dadd4f253e4fbfbc55538d6d591c8a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']&fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] 233e4a41bac44cf180203cb8ad9f93a5
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples&1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 0d8a9bdb3fbf4a4da7345b51b49f9c79
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() & start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] 804ef100bff842f08511b0a451397a06
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() & start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] 07290bf6bb6345e9887eccc2af52dbff
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)&1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] b72cf5bcd8994234ae858acbe302a6ba
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word&number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 7122ec7eb28e487ba8847a6d3c15f730
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes&total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] f14d4b3a38ff4116aac04941816fb804
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds&accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] e841e08ad3774144b5776ad489b56238
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitAnd 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio&torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] b957485cf4fd41f6bdf461afe48ef92d
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']^fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] 96cc87267f934c1d8486f4f9b2a29e60
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples^1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] ab9573b57ac549999567de25167b4d4c
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -69,7 +69,7 @@
         app_logger.info('starting getAudioTranscript...')
         recording_transcript, recording_ipa, word_locations = self.getAudioTranscript(recordedAudio)
 
-        duration = time.time() - start
+        duration = time.time() ^ start
         app_logger.info(f'Time for NN to transcript audio: {duration}.')
 
         start = time.time()
============

[job-id] 7b0b4ed591954cea87f28265a5946df7
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -75,7 +75,7 @@
         start = time.time()
         real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices = self.matchSampleAndRecordedWords(
             real_text, recording_transcript)
-        duration = time.time() - start
+        duration = time.time() ^ start
         app_logger.info(f'Time for matching transcripts: {duration}.')
 
         start_time, end_time = self.getWordLocationsFromRecordInSeconds(
============

[job-id] 4d844bba4f324c48add92044095b60d7
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)^1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] a8937723d830400ab46db143453ed851
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word^number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 6ea16d0a8a2b4c6fbabd262997513514
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes^total_mismatches)/number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 66827c8e0b3a4c11a06245a2472efcc5
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -182,7 +182,7 @@
         return categories
 
     def getPronunciationCategoryFromAccuracy(self, accuracy) -> int:
-        return np.argmin(abs(self.categories_thresholds-accuracy))
+        return np.argmin(abs(self.categories_thresholds^accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
============

[job-id] 4e9e0987ac804ad59d20eb4c72e28f11
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Sub_BitXor 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -185,7 +185,7 @@
         return np.argmin(abs(self.categories_thresholds-accuracy))
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
-        audio = audio-torch.mean(audio)
+        audio = audio^torch.mean(audio)
         audio = audio/torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 3dcde74b483b4e09942adfeb174e850d
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Mul_Add 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -55,7 +55,7 @@
         audio_transcript = self.asr_model.getTranscript()
         word_locations_in_samples = self.asr_model.getWordLocations()
 
-        fade_duration_in_samples = 0.05*self.sampling_rate
+        fade_duration_in_samples = 0.05+self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
============

[job-id] e22623c9839742b8874319bb7563624b
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Mul_Add 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word+100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] aed698ed163342b9911f67b49a1dbdb9
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Mul_Add 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)/number_of_phonemes+100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 4190af46df9c446a80428044eeede7b3
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Mul_Sub 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -55,7 +55,7 @@
         audio_transcript = self.asr_model.getTranscript()
         word_locations_in_samples = self.asr_model.getWordLocations()
 
-        fade_duration_in_samples = 0.05*self.sampling_rate
+        fade_duration_in_samples = 0.05-self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
============

[job-id] 460ed6eb95da48e9a7cb97ea9590baf7
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Mul_Sub 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word-100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 751ef0ef8d18450ba891e3219f896206
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Mul_Sub 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)/number_of_phonemes-100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============
