[job-id] 7c2e56348ae740cc86fee6f9d0720124
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mul 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])*self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] 0135920e06584f29a319f55b39974138
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mul 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)*number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] cd7abe083eb94d8dafb3cadbcd176b3a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mul 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)*number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] c333c1edd7f84ec486ff380e07e6807a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mul 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio*torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 5d833682ed9f43799e7e3dc279d2336f
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_FloorDiv 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [0])//self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] ba4167f7cb07439a9d0552b84f2989d9
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_FloorDiv 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])//self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] 3f67a179cf6e4421856ea40ae47c6b2c
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_FloorDiv 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)//number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] e1acba493c944e8d8d09fd6d8dc79da5
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_FloorDiv 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)//number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 17c1d752560e4dd38bffd1708aabc930
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_FloorDiv 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio//torch.max(torch.abs(audio))
         return audio
 
============

[job-id] f62831289d224a86bf03f179e8c30d41
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mod 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [0])%self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] 6274479de55f40238da1605edc9a6922
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mod 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])%self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] 27dbc03859704315aa2e4ecfbe1bc8ac
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mod 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)%number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] a7165424951f42fd87b24dc0577567ea
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mod 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)%number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 29e93f550bd947b2b23cf883958132a5
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Mod 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio%torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 1c9398367396436790835172bff4ed29
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Pow 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [0])**self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] e6936e65ef7747809537efb2a4d79c43
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Pow 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])**self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] e8618dc63e4341baa90e55c79f6ae483
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Pow 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)**number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 9a9c461d24f04608812009dc0a29dacc
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Pow 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)**number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] e215d330f6434105bad7aaeabba2d113
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_Pow 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio**torch.max(torch.abs(audio))
         return audio
 
============

[job-id] e9d5f31c3c8d4ac0acf2de856c02e3e8
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_RShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [0])>>self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] 635c5ee3e46e42719cca5c5c63e5a969
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_RShift 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])>>self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] 98d5ca25369f4ae7b517600480ac1bc9
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_RShift 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)>>number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] cfaa4fcaa01149b68dda06bb4e6f15d3
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_RShift 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)>>number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 1b3b85b492874ebdb6e95039b3873c6e
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_RShift 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio>>torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 122b5d8041a4441f9f1d07c23c32adb1
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_LShift 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [0])<<self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] f3e58c3410e8491e89fac63a951e40ba
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_LShift 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])<<self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] 3732b77a17504c6fa9c835cc2d025434
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_LShift 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)<<number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 22acf7aae4184973a2a7541fb0167869
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_LShift 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)<<number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] ddd25c00d85a429eb473cdce1f9c9234
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_LShift 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio<<torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 60f76a8d8c834cf69ea2d69cf2e99ead
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitOr 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [0])|self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] cac27f4ae764412794ee9f1cdc2c0f92
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitOr 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])|self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] b409a970cc384ef1ba339d25356595e3
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitOr 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)|number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 58ac8133ac9a4d04b3b6348a1b79c9a8
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitOr 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)|number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 37c03d1734544d6a823807c76fe80b65
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitOr 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio|torch.max(torch.abs(audio))
         return audio
 
============

[job-id] 1a723b8e548a4c8ba9121c7bfce8a3bc
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitAnd 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [0])&self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] a452fe1acbe04402bffb519addd96e01
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitAnd 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])&self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] e0e4f24fe8774b289148638f14976563
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitAnd 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)&number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] f4223c2900424a4fa6b6197b44a5942f
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitAnd 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)&number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============
