[job-id] e8f21543b98642ef9f2eb37a12a61e3a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitAnd 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio&torch.max(torch.abs(audio))
         return audio
 
============

[job-id] f4fca7b9ff234d1a9b7d9b8f6b054a0f
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitXor 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [0])^self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] e73698ec5b7f4455ae45c6da5393526a
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitXor 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [1])^self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] 481efc7896f8484da1189817a2e405f0
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitXor 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)^number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] b7faeeb0c29b47f9b96697927d056855
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitXor 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)^number_of_phonemes*100
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 4072d148ccd74363af93066075c0f718
aip_trainer/pronunciationTrainer.py core/ReplaceBinaryOperator_Div_BitXor 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -186,6 +186,6 @@
 
     def preprocessAudio(self, audio: torch.tensor) -> torch.tensor:
         audio = audio-torch.mean(audio)
-        audio = audio/torch.max(torch.abs(audio))
+        audio = audio^torch.max(torch.abs(audio))
         return audio
 
============

[job-id] b2270490fc304d18a78b65f70a40775d
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_NotEq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -20,7 +20,7 @@
     model.eval()
     asr_model = AIModels.NeuralASR(model, decoder)
 
-    if language == 'de':
+    if language != 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
     elif language == 'en':
============

[job-id] bb733f8e0b73446ab80513e8bc4f0fa2
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_NotEq 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -23,7 +23,7 @@
     if language == 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
-    elif language == 'en':
+    elif language != 'en':
         phonem_converter = RuleBasedModels.EngPhonemConverter()
     else:
         raise ValueError('Language not implemented')
============

[job-id] 79c19fd534374d58ae0836c7920ea0b0
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_Lt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -20,7 +20,7 @@
     model.eval()
     asr_model = AIModels.NeuralASR(model, decoder)
 
-    if language == 'de':
+    if language < 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
     elif language == 'en':
============

[job-id] dddd69ba17be4fd992741be6beb1cd51
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_Lt 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -23,7 +23,7 @@
     if language == 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
-    elif language == 'en':
+    elif language < 'en':
         phonem_converter = RuleBasedModels.EngPhonemConverter()
     else:
         raise ValueError('Language not implemented')
============

[job-id] 8bc379df8aea4cc58c0d27c60335762a
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_LtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -20,7 +20,7 @@
     model.eval()
     asr_model = AIModels.NeuralASR(model, decoder)
 
-    if language == 'de':
+    if language <= 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
     elif language == 'en':
============

[job-id] afda58e6cd15473ba4570583dd11b4ea
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_LtE 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -23,7 +23,7 @@
     if language == 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
-    elif language == 'en':
+    elif language <= 'en':
         phonem_converter = RuleBasedModels.EngPhonemConverter()
     else:
         raise ValueError('Language not implemented')
============

[job-id] 352e14cb52fe4de59a6454cba9db862c
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_Gt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -20,7 +20,7 @@
     model.eval()
     asr_model = AIModels.NeuralASR(model, decoder)
 
-    if language == 'de':
+    if language > 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
     elif language == 'en':
============

[job-id] a2e08d49818f461eb029bc4d0c4695b5
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_Gt 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -23,7 +23,7 @@
     if language == 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
-    elif language == 'en':
+    elif language > 'en':
         phonem_converter = RuleBasedModels.EngPhonemConverter()
     else:
         raise ValueError('Language not implemented')
============

[job-id] af458800efd9493ab430344a94380412
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_GtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -20,7 +20,7 @@
     model.eval()
     asr_model = AIModels.NeuralASR(model, decoder)
 
-    if language == 'de':
+    if language >= 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
     elif language == 'en':
============

[job-id] db1b5561851a4fb69db43879cec34ce4
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_GtE 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -23,7 +23,7 @@
     if language == 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
-    elif language == 'en':
+    elif language >= 'en':
         phonem_converter = RuleBasedModels.EngPhonemConverter()
     else:
         raise ValueError('Language not implemented')
============

[job-id] a92599a04d544ea7857a1780a96339b9
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_Is 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -20,7 +20,7 @@
     model.eval()
     asr_model = AIModels.NeuralASR(model, decoder)
 
-    if language == 'de':
+    if language is 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
     elif language == 'en':
============

[job-id] 40e49516a8a14018b93ff5abe3b5162c
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_Is 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -23,7 +23,7 @@
     if language == 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
-    elif language == 'en':
+    elif language is 'en':
         phonem_converter = RuleBasedModels.EngPhonemConverter()
     else:
         raise ValueError('Language not implemented')
============

[job-id] 5c15257fa5d84f4cbf5563ac944116e8
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_IsNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -20,7 +20,7 @@
     model.eval()
     asr_model = AIModels.NeuralASR(model, decoder)
 
-    if language == 'de':
+    if language is not 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
     elif language == 'en':
============

[job-id] accfcb3b58924e909f68446212741f31
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Eq_IsNot 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -23,7 +23,7 @@
     if language == 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
-    elif language == 'en':
+    elif language is not 'en':
         phonem_converter = RuleBasedModels.EngPhonemConverter()
     else:
         raise ValueError('Language not implemented')
============

[job-id] 9dbc3dc64fe34a7eb3a07768e8214008
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_GtE_Eq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx == len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 8fd5fb42d1084422b9b6b068bb25e044
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_GtE_NotEq 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx != len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] e229e4bfdca6431ebbad3d26109be60d
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_GtE_Lt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx < len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 2bfda321d0b646e688fe8d66649abf09
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_GtE_LtE 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx <= len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 132dc0b87ec34c0497b13a022b31a76b
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_GtE_Gt 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx > len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 0b2380878a8a442681e9cf2870c17e8a
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_GtE_Is 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx is len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 571e24a2a9824b2994cbc3a85e8e9d9d
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_GtE_IsNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx is not len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 66e66dad2d11465dace0cb854a6e3a77
aip_trainer/pronunciationTrainer.py core/ReplaceComparisonOperator_Is_IsNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -129,7 +129,7 @@
     def matchSampleAndRecordedWords(self, real_text, recorded_transcript):
         words_estimated = recorded_transcript.split()
 
-        if real_text is None:
+        if real_text is not None:
             words_real = self.current_transcript[0].split()
         else:
             words_real = real_text.split()
============

[job-id] aafe5073184b4574a61fb420d5e537f3
aip_trainer/pronunciationTrainer.py core/AddNot 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -20,7 +20,7 @@
     model.eval()
     asr_model = AIModels.NeuralASR(model, decoder)
 
-    if language == 'de':
+    if not language == 'de':
         epitran_deu_latn = epitran.Epitran('deu-Latn')
         phonem_converter = RuleBasedModels.EpitranPhonemConverter(epitran_deu_latn)
     elif language == 'en':
============

[job-id] 43c8daa3322e41e0bc06d6f9165dac71
aip_trainer/pronunciationTrainer.py core/AddNot 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -129,7 +129,7 @@
     def matchSampleAndRecordedWords(self, real_text, recorded_transcript):
         words_estimated = recorded_transcript.split()
 
-        if real_text is None:
+        if not real_text is None:
             words_real = self.current_transcript[0].split()
         else:
             words_real = real_text.split()
============

[job-id] 51aa92c3bf10465d85a2c1fb100297fd
aip_trainer/pronunciationTrainer.py core/AddNot 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if not word_idx >= len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] c07b81e6d4fc41729c4aa33a1e27f171
aip_trainer/pronunciationTrainer.py core/NumberReplacer 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -42,7 +42,7 @@
     current_recorded_word_locations: list
     current_recorded_intonations: torch.tensor
     current_words_pronunciation_accuracy = []
-    categories_thresholds = np.array([80, 60, 59])
+    categories_thresholds = np.array([ 81, 60, 59])
 
     sampling_rate = 16000
 
============

[job-id] 4f5bbb80f8964d119c228c1965ceb089
aip_trainer/pronunciationTrainer.py core/NumberReplacer 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -42,7 +42,7 @@
     current_recorded_word_locations: list
     current_recorded_intonations: torch.tensor
     current_words_pronunciation_accuracy = []
-    categories_thresholds = np.array([80, 60, 59])
+    categories_thresholds = np.array([ 79, 60, 59])
 
     sampling_rate = 16000
 
============

[job-id] 992bae5337f348e7b53b0c115b593211
aip_trainer/pronunciationTrainer.py core/NumberReplacer 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -42,7 +42,7 @@
     current_recorded_word_locations: list
     current_recorded_intonations: torch.tensor
     current_words_pronunciation_accuracy = []
-    categories_thresholds = np.array([80, 60, 59])
+    categories_thresholds = np.array([80, 61, 59])
 
     sampling_rate = 16000
 
============

[job-id] 6bd275b10f9c40ebbc85d5d217b787ea
aip_trainer/pronunciationTrainer.py core/NumberReplacer 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -42,7 +42,7 @@
     current_recorded_word_locations: list
     current_recorded_intonations: torch.tensor
     current_words_pronunciation_accuracy = []
-    categories_thresholds = np.array([80, 60, 59])
+    categories_thresholds = np.array([80, 59, 59])
 
     sampling_rate = 16000
 
============

[job-id] d7ed4ff9e4c34d919d80219a6f311c7d
aip_trainer/pronunciationTrainer.py core/NumberReplacer 4
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -42,7 +42,7 @@
     current_recorded_word_locations: list
     current_recorded_intonations: torch.tensor
     current_words_pronunciation_accuracy = []
-    categories_thresholds = np.array([80, 60, 59])
+    categories_thresholds = np.array([80, 60, 60])
 
     sampling_rate = 16000
 
============

[job-id] 7a8229cf9e144ccc9d9296502919daaa
aip_trainer/pronunciationTrainer.py core/NumberReplacer 5
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -42,7 +42,7 @@
     current_recorded_word_locations: list
     current_recorded_intonations: torch.tensor
     current_words_pronunciation_accuracy = []
-    categories_thresholds = np.array([80, 60, 59])
+    categories_thresholds = np.array([80, 60, 58])
 
     sampling_rate = 16000
 
============

[job-id] 701e0842cac243859e473b9dc04495a7
aip_trainer/pronunciationTrainer.py core/NumberReplacer 6
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -44,7 +44,7 @@
     current_words_pronunciation_accuracy = []
     categories_thresholds = np.array([80, 60, 59])
 
-    sampling_rate = 16000
+    sampling_rate = 16001
 
     def __init__(self, asr_model: mi.IASRModel, word_to_ipa_coverter: mi.ITextToPhonemModel) -> None:
         self.asr_model = asr_model
============

[job-id] 4ba7326d858449e7884aa3ed398d3907
aip_trainer/pronunciationTrainer.py core/NumberReplacer 7
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -44,7 +44,7 @@
     current_words_pronunciation_accuracy = []
     categories_thresholds = np.array([80, 60, 59])
 
-    sampling_rate = 16000
+    sampling_rate = 15999
 
     def __init__(self, asr_model: mi.IASRModel, word_to_ipa_coverter: mi.ITextToPhonemModel) -> None:
         self.asr_model = asr_model
============

[job-id] 1289eb197ea54bc591765a3a6286cf8d
aip_trainer/pronunciationTrainer.py core/NumberReplacer 8
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -55,7 +55,7 @@
         audio_transcript = self.asr_model.getTranscript()
         word_locations_in_samples = self.asr_model.getWordLocations()
 
-        fade_duration_in_samples = 0.05*self.sampling_rate
+        fade_duration_in_samples = 1.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
============

[job-id] 1c1fc95677aa4f3993c8cbeb61a0b608
aip_trainer/pronunciationTrainer.py core/NumberReplacer 9
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -55,7 +55,7 @@
         audio_transcript = self.asr_model.getTranscript()
         word_locations_in_samples = self.asr_model.getWordLocations()
 
-        fade_duration_in_samples = 0.05*self.sampling_rate
+        fade_duration_in_samples = -0.95*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
============

[job-id] cdfba2275aab4a8d9ff2d90ebe084fa2
aip_trainer/pronunciationTrainer.py core/NumberReplacer 10
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum( 1, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============

[job-id] 2e57393a818145a59664768081722c58
aip_trainer/pronunciationTrainer.py core/NumberReplacer 11
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -56,7 +56,7 @@
         word_locations_in_samples = self.asr_model.getWordLocations()
 
         fade_duration_in_samples = 0.05*self.sampling_rate
-        word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
+        word_locations_in_samples = [(int(np.maximum( -1, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
             audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
============
