[job-id] 9a3185db768644d080735dabfd3fea2d
aip_trainer/pronunciationTrainer.py core/NumberReplacer 12
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples- 2, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] 8364c34d2d6448cba2156e4ecba09ecc
aip_trainer/pronunciationTrainer.py core/NumberReplacer 13
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -57,7 +57,7 @@
 
         fade_duration_in_samples = 0.05*self.sampling_rate
         word_locations_in_samples = [(int(np.maximum(0, word['start_ts']-fade_duration_in_samples)), int(np.minimum(
-            audio_length_in_samples-1, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
+            audio_length_in_samples- 0, word['end_ts']+fade_duration_in_samples))) for word in word_locations_in_samples]
 
         return audio_transcript, word_locations_in_samples
 
============

[job-id] bc2e87185c5f41f6829cd2e1777b67b9
aip_trainer/pronunciationTrainer.py core/NumberReplacer 14
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -106,7 +106,7 @@
 
         app_logger.info('starting getTranscriptAndWordsLocations...')
         current_recorded_transcript, current_recorded_word_locations = self.getTranscriptAndWordsLocations(
-            current_recorded_audio.shape[1])
+            current_recorded_audio.shape[ 2])
         app_logger.info('starting convertToPhonem...')
         current_recorded_ipa = self.ipa_converter.convertToPhonem(current_recorded_transcript)
 
============

[job-id] 30279a595c7b4fc1a4544f482130e95d
aip_trainer/pronunciationTrainer.py core/NumberReplacer 15
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -106,7 +106,7 @@
 
         app_logger.info('starting getTranscriptAndWordsLocations...')
         current_recorded_transcript, current_recorded_word_locations = self.getTranscriptAndWordsLocations(
-            current_recorded_audio.shape[1])
+            current_recorded_audio.shape[ 0])
         app_logger.info('starting convertToPhonem...')
         current_recorded_ipa = self.ipa_converter.convertToPhonem(current_recorded_transcript)
 
============

[job-id] 84d9a8fde74042beb722df30e01d7406
aip_trainer/pronunciationTrainer.py core/NumberReplacer 16
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [ 1])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] 22a33b3e04454a30a01cc30664e16cc7
aip_trainer/pronunciationTrainer.py core/NumberReplacer 17
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -118,7 +118,7 @@
         end_time = []
         for word_idx in range(len(mapped_words_indices)):
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                    [0])/self.sampling_rate)
+                                    [ -1])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                   [1])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
============

[job-id] 5331ec7ccf0149558a3b87d0aa0f3ac8
aip_trainer/pronunciationTrainer.py core/NumberReplacer 18
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [ 2])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] 718ccd5f9f4a4b2ebd223aea4a6982bd
aip_trainer/pronunciationTrainer.py core/NumberReplacer 19
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -120,7 +120,7 @@
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
-                                  [1])/self.sampling_rate)
+                                  [ 0])/self.sampling_rate)
         return ' '.join([str(time) for time in start_time]), ' '.join([str(time) for time in end_time])
 
     ##################### END ASR Functions ###########################
============

[job-id] 4f480226df8a424d89aa4a6f9d34a4b6
aip_trainer/pronunciationTrainer.py core/NumberReplacer 20
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -130,7 +130,7 @@
         words_estimated = recorded_transcript.split()
 
         if real_text is None:
-            words_real = self.current_transcript[0].split()
+            words_real = self.current_transcript[ 1].split()
         else:
             words_real = real_text.split()
 
============

[job-id] 24e7d697b9b74f26a3220d39b775bba0
aip_trainer/pronunciationTrainer.py core/NumberReplacer 21
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -130,7 +130,7 @@
         words_estimated = recorded_transcript.split()
 
         if real_text is None:
-            words_real = self.current_transcript[0].split()
+            words_real = self.current_transcript[ -1].split()
         else:
             words_real = real_text.split()
 
============

[job-id] 507e456e3913428e92da6e59f611d751
aip_trainer/pronunciationTrainer.py core/NumberReplacer 22
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)- 2:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] e5b9bcf6f7b946e5bc65f00f6c361afd
aip_trainer/pronunciationTrainer.py core/NumberReplacer 23
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.SURVIVED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -140,7 +140,7 @@
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
         for word_idx in range(len(words_real)):
-            if word_idx >= len(mapped_words)-1:
+            if word_idx >= len(mapped_words)- 0:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
                 (words_real[word_idx],    mapped_words[word_idx]))
============

[job-id] 3329fcc5a6104f9cb1d7269bc34d5054
aip_trainer/pronunciationTrainer.py core/NumberReplacer 24
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -149,7 +149,7 @@
         return real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices
 
     def getPronunciationAccuracy(self, real_and_transcribed_words_ipa) -> tuple[float, list]:
-        total_mismatches = 0.
+        total_mismatches = 1.0
         number_of_phonemes = 0.
         current_words_pronunciation_accuracy = []
         for pair in real_and_transcribed_words_ipa:
============

[job-id] c682abd9ee3845509399fa74981869b0
aip_trainer/pronunciationTrainer.py core/NumberReplacer 25
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -149,7 +149,7 @@
         return real_and_transcribed_words, real_and_transcribed_words_ipa, mapped_words_indices
 
     def getPronunciationAccuracy(self, real_and_transcribed_words_ipa) -> tuple[float, list]:
-        total_mismatches = 0.
+        total_mismatches = -1.0
         number_of_phonemes = 0.
         current_words_pronunciation_accuracy = []
         for pair in real_and_transcribed_words_ipa:
============

[job-id] 1789ccf68c5c48e9aea80ddbaa9c1aa5
aip_trainer/pronunciationTrainer.py core/NumberReplacer 26
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -150,7 +150,7 @@
 
     def getPronunciationAccuracy(self, real_and_transcribed_words_ipa) -> tuple[float, list]:
         total_mismatches = 0.
-        number_of_phonemes = 0.
+        number_of_phonemes = 1.0
         current_words_pronunciation_accuracy = []
         for pair in real_and_transcribed_words_ipa:
 
============

[job-id] 3d4181af95b84982bba80946e016dcc1
aip_trainer/pronunciationTrainer.py core/NumberReplacer 27
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -150,7 +150,7 @@
 
     def getPronunciationAccuracy(self, real_and_transcribed_words_ipa) -> tuple[float, list]:
         total_mismatches = 0.
-        number_of_phonemes = 0.
+        number_of_phonemes = -1.0
         current_words_pronunciation_accuracy = []
         for pair in real_and_transcribed_words_ipa:
 
============

[job-id] f0164f60deb945e89e518c152db8be3e
aip_trainer/pronunciationTrainer.py core/NumberReplacer 28
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -154,7 +154,7 @@
         current_words_pronunciation_accuracy = []
         for pair in real_and_transcribed_words_ipa:
 
-            real_without_punctuation = self.removePunctuation(pair[0]).lower()
+            real_without_punctuation = self.removePunctuation(pair[ 1]).lower()
             number_of_word_mismatches = WordMetrics.edit_distance_python(
                 real_without_punctuation, self.removePunctuation(pair[1]).lower())
             total_mismatches += number_of_word_mismatches
============

[job-id] be777ac2015b47c4bce9c37ecb9de16f
aip_trainer/pronunciationTrainer.py core/NumberReplacer 29
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -154,7 +154,7 @@
         current_words_pronunciation_accuracy = []
         for pair in real_and_transcribed_words_ipa:
 
-            real_without_punctuation = self.removePunctuation(pair[0]).lower()
+            real_without_punctuation = self.removePunctuation(pair[ -1]).lower()
             number_of_word_mismatches = WordMetrics.edit_distance_python(
                 real_without_punctuation, self.removePunctuation(pair[1]).lower())
             total_mismatches += number_of_word_mismatches
============

[job-id] b8770967d07b46c9828fef7065f635d1
aip_trainer/pronunciationTrainer.py core/NumberReplacer 30
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -156,7 +156,7 @@
 
             real_without_punctuation = self.removePunctuation(pair[0]).lower()
             number_of_word_mismatches = WordMetrics.edit_distance_python(
-                real_without_punctuation, self.removePunctuation(pair[1]).lower())
+                real_without_punctuation, self.removePunctuation(pair[ 2]).lower())
             total_mismatches += number_of_word_mismatches
             number_of_phonemes_in_word = len(real_without_punctuation)
             number_of_phonemes += number_of_phonemes_in_word
============

[job-id] a011e7c7ec664502baf3ad279d3fffad
aip_trainer/pronunciationTrainer.py core/NumberReplacer 31
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -156,7 +156,7 @@
 
             real_without_punctuation = self.removePunctuation(pair[0]).lower()
             number_of_word_mismatches = WordMetrics.edit_distance_python(
-                real_without_punctuation, self.removePunctuation(pair[1]).lower())
+                real_without_punctuation, self.removePunctuation(pair[ 0]).lower())
             total_mismatches += number_of_word_mismatches
             number_of_phonemes_in_word = len(real_without_punctuation)
             number_of_phonemes += number_of_phonemes_in_word
============

[job-id] 73f950c6088f4b3790dc3f7c1dbad094
aip_trainer/pronunciationTrainer.py core/NumberReplacer 32
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word* 101)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 2b81e6c63bc547a2bc0c4946cdceb669
aip_trainer/pronunciationTrainer.py core/NumberReplacer 33
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -162,7 +162,7 @@
             number_of_phonemes += number_of_phonemes_in_word
 
             current_words_pronunciation_accuracy.append(float(
-                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
+                number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word* 99)
 
         percentage_of_correct_pronunciations = (
             number_of_phonemes-total_mismatches)/number_of_phonemes*100
============

[job-id] 02a4def168984207b8d3271f21242921
aip_trainer/pronunciationTrainer.py core/NumberReplacer 34
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)/number_of_phonemes* 101
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] 07d40fb8252a4fe2b1164937b2ae9228
aip_trainer/pronunciationTrainer.py core/NumberReplacer 35
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -165,7 +165,7 @@
                 number_of_phonemes_in_word-number_of_word_mismatches)/number_of_phonemes_in_word*100)
 
         percentage_of_correct_pronunciations = (
-            number_of_phonemes-total_mismatches)/number_of_phonemes*100
+            number_of_phonemes-total_mismatches)/number_of_phonemes* 99
 
         return np.round(percentage_of_correct_pronunciations), current_words_pronunciation_accuracy
 
============

[job-id] db09c631c70049d3a08622e853bc2d60
aip_trainer/pronunciationTrainer.py core/ZeroIterationForLoop 0
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -116,7 +116,7 @@
     def getWordLocationsFromRecordInSeconds(self, word_locations, mapped_words_indices) -> tuple[str, str]:
         start_time = []
         end_time = []
-        for word_idx in range(len(mapped_words_indices)):
+        for word_idx in []:
             start_time.append(float(word_locations[mapped_words_indices[word_idx]]
                                     [0])/self.sampling_rate)
             end_time.append(float(word_locations[mapped_words_indices[word_idx]]
============

[job-id] f93918793f9443899384b63dc2011cf6
aip_trainer/pronunciationTrainer.py core/ZeroIterationForLoop 1
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -139,7 +139,7 @@
 
         real_and_transcribed_words = []
         real_and_transcribed_words_ipa = []
-        for word_idx in range(len(words_real)):
+        for word_idx in []:
             if word_idx >= len(mapped_words)-1:
                 mapped_words.append('-')
             real_and_transcribed_words.append(
============

[job-id] 8a5abe7730d9433c9d1f4043fd07c77b
aip_trainer/pronunciationTrainer.py core/ZeroIterationForLoop 2
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -152,7 +152,7 @@
         total_mismatches = 0.
         number_of_phonemes = 0.
         current_words_pronunciation_accuracy = []
-        for pair in real_and_transcribed_words_ipa:
+        for pair in []:
 
             real_without_punctuation = self.removePunctuation(pair[0]).lower()
             number_of_word_mismatches = WordMetrics.edit_distance_python(
============

[job-id] 32fc2d437dfc4f56882e1fe0302b8f26
aip_trainer/pronunciationTrainer.py core/ZeroIterationForLoop 3
worker outcome: WorkerOutcome.NORMAL, test outcome: TestOutcome.KILLED
=== DIFF ===
--- mutation diff ---
--- aaip_trainer/pronunciationTrainer.py
+++ baip_trainer/pronunciationTrainer.py
@@ -175,7 +175,7 @@
     def getWordsPronunciationCategory(self, accuracies) -> list:
         categories = []
 
-        for accuracy in accuracies:
+        for accuracy in []:
             categories.append(
                 self.getPronunciationCategoryFromAccuracy(accuracy))
 
============
total jobs: 263
complete: 263 (100.00%)
surviving mutants: 51 (19.39%)
